ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/ADC_R_ADC_R_CFG_502C5000h.xml
<module name="ADC_R_CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="ADC_R_CFG_ADCCTL1" acronym="ADC_R_CFG_ADCCTL1" offset="0" width="16" description="ADC Control 1 Register.">
		<bitfield id="TDMAEN" width="1" begin="15" end="15" resetval="0x0" description="Enable Alternate DMA Timings. This bit controls when the DMA is triggered.   0  DMA is triggered at the same time as the CPU interrupt   1 DMA is always triggered at tDMA regardless or whether the ADC is in early interrupt mode or late interrupt mode" range="15" rwaccess="R/W"/>
	<bitfield id="EXTMUXPRESELECTEN" width="1" begin="14" end="14" resetval="0x0" description="If th the ADC SOC sequence is deterministic, the ADCEXTMUX pins can be set earlier: at the end of the S+H window of the previous conversion instead of the beginning of the S+H window of the current conversion.  This allows some of the external mux settling time to be pipelined with the previous conversion's conversion time.  However, this will not work in the case where high-priority SOCs can arrive asynchronously.     0  ADCEXTMUX pins only change at beginning of S+H window   1  ADCEXTMUX pins are set after the end of S+H window based on pending SOCs" range="14" rwaccess="R/W"/>
	<bitfield id="ADCBSY" width="1" begin="13" end="13" resetval="0x0" description="ADC Busy. Set when ADC SOC is generated, cleared by hardware four ADC clocks after negative edge of S/H pulse. Used by the ADC state machine to determine if ADC is available to sample.   0  ADC is available to sample next channel   1  ADC is busy and cannot sample another channel" range="13" rwaccess="R"/>
	<bitfield id="ADCBSYCHN" width="4" begin="11" end="8" resetval="0x0" description="ADC Busy Channel. Set when an ADC Start of Conversion [SOC] is generated. When ADCBSY0:holds the value of the last converted SOC When ADCBSY1:reflects the SOC currently being processed  0h SOC0 is currently processing or was last SOC converted  1h SOC1 is currently processing or was last SOC converted  2h SOC2 is currently processing or was last SOC converted  3h SOC3 is currently processing or was last SOC converted  4h SOC4 is currently processing or was last SOC converted  5h SOC5 is currently processing or was last SOC converted  6h SOC6 is currently processing or was last SOC converted  7h SOC7 is currently processing or was last SOC converted  8h SOC8 is currently processing or was last SOC converted  9h SOC9 is currently processing or was last SOC converted   Ah  SOC10 is currently processing or was last SOC converted   Bh  SOC11 is currently processing or was last SOC converted   Ch  SOC12 is currently processing or was last SOC converted   Dh  SOC13 is currently processing or was last SOC converted   Eh  SOC14 is currently processing or was last SOC converted   Fh  SOC15 is currently processing or was last SOC converted" range="11:8" rwaccess="R"/>
	<bitfield id="ADCPWDNZ" width="1" begin="7" end="7" resetval="0x0" description="ADC Power Down [active low]. This bit controls the power up and power down of all the analog circuitry inside the analog core.   0  All analog circuitry inside the core is powered down   1  All analog circuitry inside the core is powered up" range="7" rwaccess="R/W"/>
	<bitfield id="INTPULSEPOS" width="1" begin="2" end="2" resetval="0x0" description="ADC Interrupt Pulse Position.   0  Interrupt  pulse generation occurs when ADC begins conversion [at the end of the acquisition window] plus a number of SYSCLK cycles as specified in the ADCINTCYCLE.OFFSET register.   1  Interrupt pulse generation occurs at the end of the conversion, 1 cycle prior to the ADC result latching into its result register" range="2" rwaccess="R/W"/>
	</register><register id="ADC_R_CFG_ADCCTL2" acronym="ADC_R_CFG_ADCCTL2" offset="2" width="16" description="ADC Control 2 Register.">
		<bitfield id="SIGNALMODE" width="1" begin="7" end="7" resetval="0x0" description="SOC Signaling Mode. Selects the input mode of the converter. Use the AdcSetMode function to change the signal mode.   0  Single-ended   1  Differential" range="7" rwaccess="R/W"/>
	<bitfield id="RESOLUTION" width="1" begin="6" end="6" resetval="0x0" description="SOC Conversion Resolution. Selects the resolution of the converter. Use the AdcSetMode function to change the resolution.   0  12-bit resolution" range="6" rwaccess="R/W"/>
	<bitfield id="PRESCALE" width="4" begin="3" end="0" resetval="0x0" description="ADC Clock Prescaler.  0000 ADCCLK = Input Clock / 1.0  0001 Invalid  0010 ADCCLK = Input Clock / 2.0  0011 ADCCLK = Input Clock / 2.5  0100 ADCCLK = Input Clock / 3.0  0101 ADCCLK = Input Clock / 3.5  0110 ADCCLK = Input Clock / 4.0  0111 ADCCLK = Input Clock / 4.5  1000 ADCCLK = Input Clock / 5.0  1001 ADCCLK = Input Clock / 5.5  1010 ADCCLK = Input Clock / 6.0  1011 ADCCLK = Input Clock / 6.5  1100 ADCCLK = Input Clock / 7.0  1101 ADCCLK = Input Clock / 7.5  1110 ADCCLK = Input Clock / 8.0  1111 ADCCLK = Input Clock / 8.5" range="3:0" rwaccess="R/W"/>
	</register><register id="ADC_R_CFG_ADCBURSTCTL" acronym="ADC_R_CFG_ADCBURSTCTL" offset="4" width="16" description="ADC Burst Control Register.">
		<bitfield id="BURSTEN" width="1" begin="15" end="15" resetval="0x0" description="SOC Burst Mode Enable. This bit enables the SOC Burst Mode of operation.   0  Burst mode is disabled.   1  Burst mode is enabled." range="15" rwaccess="R/W"/>
	<bitfield id="BURSTSIZE" width="4" begin="11" end="8" resetval="0x0" description="SOC Burst Size Select. This bit field determines how many SOCs are converted when a burst conversion sequence is started. The first SOC converted is defined by the round robin pointer, which is advanced as each SOC is converted.  0h 1 SOC converted  1h 2 SOCs converted  2h 3 SOCs converted  3h 4 SOCs converted  4h 5 SOCs converted  5h 6 SOCs converted  6h 7 SOCs converted  7h 8 SOCs converted  8h 9 SOCs converted  9h 10 SOCs converted   Ah  11 SOCs converted   Bh  12 SOCs converted   Ch  13 SOCs converted   Dh  14 SOCs converted   Eh  15 SOCs converted   Fh  16 SOCs converted Note: If the burst causes SOCs to be set for conversion that were already pending, the corresponding bits in the ADCSOCOVF register will be set." range="11:8" rwaccess="R/W"/>
	<bitfield id="BURSTTRIGSEL" width="7" begin="6" end="0" resetval="0x0" description="SOC Burst Trigger Source Select. Configures which trigger will start a burst conversion sequence. Note: SOCFRC1 register can always be used to software trigger SOCs in addition to any hardware trigger configuration.  00h BURSTTRIG0 - Software only  01h BURSTTRIG1 - RTI0 Timer 02h BURSTTRIG2 - RTI1 Timer  03h BURSTTRIG3 - RTI2 Timer 04h BURSTTRIG4 - RTI3 Timer 05h BURSTTRIG5 - InputXBAR.Out[5] 06h BURSTTRIG6 - spare  07h BURSTTRIG7 - spare  08h BURSTTRIG8 - EPWM0, ADCSOCA  09h BURSTTRIG9 - EPWM0, ADCSOCB   0Ah  BURSTTRIG10 - EPWM1, ADCSOCA   0Bh  BURSTTRIG11 - EPWM1, ADCSOCB   0Ch  BURSTTRIG12 - EPWM2, ADCSOCA   0Dh  BURSTTRIG13 - EPWM2, ADCSOCB   0Eh  BURSTTRIG14 - EPWM3, ADCSOCA   0Fh  BURSTTRIG15 - EPWM3, ADCSOCB   .... EPWM4 to EPWM27 40h BURSTTRIG64 - EPWM28, ADCSOCA  41h BURSTTRIG65 - EPWM28, ADCSOCB  42h BURSTTRIG66 - EPWM29, ADCSOCA  43h BURSTTRIG67 - EPWM29, ADCSOCB  44h BURSTTRIG68 - EPWM30, ADCSOCA  45h BURSTTRIG69 - EPWM30, ADCSOCB  46h BURSTTRIG70 - EPWM31, ADCSOCA  47h BURSTTRIG71 - EPWM31, ADCSOCB  48h BURSTTRIG72 - ECAP0, TRIGOUT  .... ECAP1 to ECAP8  51h BURSTTRIG81 - ECAP9, TRIGOUT  52h BURSTTRIG82 - ECAP10, TRIGOUT  ....  57h BURSTTRIG73 - ECAP15, TRIGOUT 58h BURSTTRIG1  - RTI4 Timer  59h BURSTTRIG1  - RTI5 Timer   5Ah  BURSTTRIG1  - RTI6 Timer   5Bh  BURSTTRIG1  - RTI7 Timer   " range="6:0" rwaccess="R/W"/>
	</register><register id="ADC_R_CFG_ADCINTFLG" acronym="ADC_R_CFG_ADCINTFLG" offset="6" width="16" description="ADC Interrupt Flag Register.">
		<bitfield id="ADCINT4RESULT" width="1" begin="7" end="7" resetval="0x0" description="ADC Interrupt 4 Results Ready Flag. This flag is set when the conversions results associated with ADCINT4 latch into the corresponding results register.     0  Conversion results have not latched   1  Conversion results have latched This flag can be used in an ISR that is entered in early interrupt mode to ensure that the corresponding results are ready before proceeding to read the result register.   This flag can be cleared via the ACK bit in the ADCINTFLGCLR that also clears the ADCINT4 flag.    In case results latch and this flag is already set, the corresponding flag in ADCINTOVF is NOT set.  This flag does NOT have to be cleared in order for ADCINT ISRs to propagate to the PIE.   In case the associated SOC is associated with a PPB or PPBs, the flag will not be set until all associated PPB results latch." range="7" rwaccess="R"/>
	<bitfield id="ADCINT3RESULT" width="1" begin="6" end="6" resetval="0x0" description="ADC Interrupt 3 Results Ready Flag. This flag is set when the conversions results associated with ADCINT3 latch into the corresponding results register.     0  Conversion results have not latched   1  Conversion results have latched This flag can be used in an ISR that is entered in early interrupt mode to ensure that the corresponding results are ready before proceeding to read the result register.   This flag can be cleared via the ACK bit in the ADCINTFLGCLR that also clears the ADCINT3 flag.    In case results latch and this flag is already set, the corresponding flag in ADCINTOVF is NOT set.  This flag does NOT have to be cleared in order for ADCINT ISRs to propagate to the PIE.   In case the associated SOC is associated with a PPB or PPBs, the flag will not be set until all associated PPB results latch." range="6" rwaccess="R"/>
	<bitfield id="ADCINT2RESULT" width="1" begin="5" end="5" resetval="0x0" description="ADC Interrupt 2 Results Ready Flag. This flag is set when the conversions results associated with ADCINT2 latch into the corresponding results register.     0  Conversion results have not latched   1  Conversion results have latched This flag can be used in an ISR that is entered in early interrupt mode to ensure that the corresponding results are ready before proceeding to read the result register.   This flag can be cleared via the ACK bit in the ADCINTFLGCLR that also clears the ADCINT2 flag.    In case results latch and this flag is already set, the corresponding flag in ADCINTOVF is NOT set.  This flag does NOT have to be cleared in order for ADCINT ISRs to propagate to the PIE.   In case the associated SOC is associated with a PPB or PPBs, the flag will not be set until all associated PPB results latch." range="5" rwaccess="R"/>
	<bitfield id="ADCINT1RESULT" width="1" begin="4" end="4" resetval="0x0" description="ADC Interrupt 1 Results Ready Flag. This flag is set when the conversions results associated with ADCINT1 latch into the corresponding results register.     0  Conversion results have not latched   1  Conversion results have latched This flag can be used in an ISR that is entered in early interrupt mode to ensure that the corresponding results are ready before proceeding to read the result register.   This flag can be cleared via the ACK bit in the ADCINTFLGCLR that also clears the ADCINT1 flag.    In case results latch and this flag is already set, the corresponding flag in ADCINTOVF is NOT set.  This flag does NOT have to be cleared in order for ADCINT ISRs to propagate to the PIE.   In case the associated SOC is associated with a PPB or PPBs, the flag will not be set until all associated PPB results latch." range="4" rwaccess="R"/>
	<bitfield id="ADCINT4" width="1" begin="3" end="3" resetval="0x0" description="ADC Interrupt 4 Flag. Reading these flags indicates if the associated ADCINT pulse was generated since the last clear.   0  No ADC interrupt pulse generated   1  ADC interrupt pulse generated If the ADC interrupt is placed in continue to interrupt mode [INTSELxNy register] then further interrupt pulses are generated whenever a selected EOC event occurs even if the flag bit is set. If the continuous mode is not enabled, then no further interrupt pulses are generated until the user clears this flag bit using the ADCINFLGCLR register. Rather, an ADC interrupt overflow event occurs in the ADCINTOVF register." range="3" rwaccess="R"/>
	<bitfield id="ADCINT3" width="1" begin="2" end="2" resetval="0x0" description="ADC Interrupt 3 Flag. Reading these flags indicates if the associated ADCINT pulse was generated since the last clear.   0  No ADC interrupt pulse generated   1  ADC interrupt pulse generated If the ADC interrupt is placed in continue to interrupt mode [INTSELxNy register] then further interrupt pulses are generated whenever a selected EOC event occurs even if the flag bit is set. If the continuous mode is not enabled, then no further interrupt pulses are generated until the user clears this flag bit using the ADCINTFLGCLR register. Rather, an ADC interrupt overflow event occurs in the ADCINTOVF register." range="2" rwaccess="R"/>
	<bitfield id="ADCINT2" width="1" begin="1" end="1" resetval="0x0" description="ADC Interrupt 2 Flag. Reading these flags indicates if the associated ADCINT pulse was generated since the last clear.   0  No ADC interrupt pulse generated   1  ADC interrupt pulse generated If the ADC interrupt is placed in continue to interrupt mode [INTSELxNy register] then further interrupt pulses are generated whenever a selected EOC event occurs even if the flag bit is set. If the continuous mode is not enabled, then no further interrupt pulses are generated until the user clears this flag bit using the ADCINTFLGCLR register. Rather, an ADC interrupt overflow event occurs in the ADCINTOVF register." range="1" rwaccess="R"/>
	<bitfield id="ADCINT1" width="1" begin="0" end="0" resetval="0x0" description="ADC Interrupt 1 Flag. Reading these flags indicates if the associated ADCINT pulse was generated since the last clear.   0  No ADC interrupt pulse generated   1  ADC interrupt pulse generated If the ADC interrupt is placed in continue to interrupt mode [INTSELxNy register] then further interrupt pulses are generated whenever a selected EOC event occurs even if the flag bit is set. If the continuous mode is not enabled, then no further interrupt pulses are generated until the user clears this flag bit using the ADCINTFLGCLR register. Rather, an ADC interrupt overflow event occurs in the ADCINTOVF register." range="0" rwaccess="R"/>
	</register><register id="ADC_R_CFG_ADCINTFLGCLR" acronym="ADC_R_CFG_ADCINTFLGCLR" offset="8" width="16" description="ADC Interrupt Flag Clear Register.">
		<bitfield id="ADCINT4" width="1" begin="3" end="3" resetval="0x0" description="ADC Interrupt 4 Flag Clear. Reads return 0.   0  No action   1  Clears respective flag bit in the ADCINTFLG register. If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will not be set" range="3" rwaccess="R/W1TS"/>
	<bitfield id="ADCINT3" width="1" begin="2" end="2" resetval="0x0" description="ADC Interrupt 3 Flag Clear. Reads return 0.   0  No action   1  Clears respective flag bit in the ADCINTFLG register. If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will not be set" range="2" rwaccess="R/W1TS"/>
	<bitfield id="ADCINT2" width="1" begin="1" end="1" resetval="0x0" description="ADC Interrupt 2 Flag Clear. Reads return 0.   0  No action   1  Clears respective flag bit in the ADCINTFLG register. If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will not be set" range="1" rwaccess="R/W1TS"/>
	<bitfield id="ADCINT1" width="1" begin="0" end="0" resetval="0x0" description="ADC Interrupt 1 Flag Clear. Reads return 0.   0  No action   1  Clears respective flag bit in the ADCINTFLG register. If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will not be set" range="0" rwaccess="R/W1TS"/>
	</register><register id="ADC_R_CFG_ADCINTOVF" acronym="ADC_R_CFG_ADCINTOVF" offset="10" width="16" description="ADC Interrupt Overflow Register.">
		<bitfield id="ADCINT4" width="1" begin="3" end="3" resetval="0x0" description="ADC Interrupt 4 Overflow Flags Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs.   0  No ADC interrupt overflow event detected.   1  ADC Interrupt overflow event detected. The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." range="3" rwaccess="R"/>
	<bitfield id="ADCINT3" width="1" begin="2" end="2" resetval="0x0" description="ADC Interrupt 3 Overflow Flags Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs.   0  No ADC interrupt overflow event detected.   1  ADC Interrupt overflow event detected. The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." range="2" rwaccess="R"/>
	<bitfield id="ADCINT2" width="1" begin="1" end="1" resetval="0x0" description="ADC Interrupt 2 Overflow Flags Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs.   0  No ADC interrupt overflow event detected.   1  ADC Interrupt overflow event detected. The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." range="1" rwaccess="R"/>
	<bitfield id="ADCINT1" width="1" begin="0" end="0" resetval="0x0" description="ADC Interrupt 1 Overflow Flags Indicates if an overflow occurred when generating ADCINT pulses. If the respective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs.   0  No ADC interrupt overflow event detected.   1  ADC Interrupt overflow event detected. The overflow bit does not care about the continuous mode bit state. An overflow condition is generated irrespective of this mode selection." range="0" rwaccess="R"/>
	</register><register id="ADC_R_CFG_ADCINTOVFCLR" acronym="ADC_R_CFG_ADCINTOVFCLR" offset="12" width="16" description="ADC Interrupt Overflow Clear Register.">
		<bitfield id="ADCINT4" width="1" begin="3" end="3" resetval="0x0" description="ADC Interrupt 4 Overflow Clear Bits   0  No action.   1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." range="3" rwaccess="R/W1TS"/>
	<bitfield id="ADCINT3" width="1" begin="2" end="2" resetval="0x0" description="ADC Interrupt 3 Overflow Clear Bits   0  No action.   1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." range="2" rwaccess="R/W1TS"/>
	<bitfield id="ADCINT2" width="1" begin="1" end="1" resetval="0x0" description="ADC Interrupt 2 Overflow Clear Bits   0  No action.   1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." range="1" rwaccess="R/W1TS"/>
	<bitfield id="ADCINT1" width="1" begin="0" end="0" resetval="0x0" description="ADC Interrupt 1 Overflow Clear Bits   0  No action.   1  Clears the respective overflow bit in the ADCINTOVF register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the ADCINTOVF register, then hardware has priority and the ADCINTOVF bit will be set." range="0" rwaccess="R/W1TS"/>
	</register><register id="ADC_R_CFG_ADCINTSEL1N2" acronym="ADC_R_CFG_ADCINTSEL1N2" offset="14" width="16" description="ADC Interrupt 1 and 2 Selection Register.">
		<bitfield id="INT2CONT" width="1" begin="14" end="14" resetval="0x0" description="ADCINT2 Continue to Interrupt Mode   0  No further ADCINT2 pulses are generated until ADCINT2 flag [in ADCINTFLG register] is cleared by user.   1  ADCINT2 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." range="14" rwaccess="R/W"/>
	<bitfield id="INT2E" width="1" begin="13" end="13" resetval="0x0" description="ADCINT2 Interrupt Enable   0  ADCINT2 is disabled   1  ADCINT2 is enabled" range="13" rwaccess="R/W"/>
	<bitfield id="INT2SEL" width="5" begin="12" end="8" resetval="0x0" description="ADCINT2 EOC Source Select  00h EOC0 is trigger for ADCINT2  01h EOC1 is trigger for ADCINT2  02h EOC2 is trigger for ADCINT2  03h EOC3 is trigger for ADCINT2  04h EOC4 is trigger for ADCINT2  05h EOC5 is trigger for ADCINT2  06h EOC6 is trigger for ADCINT2  07h EOC7 is trigger for ADCINT2  08h EOC8 is trigger for ADCINT2  09h EOC9 is trigger for ADCINT2   0Ah  EOC10 is trigger for ADCINT2   0Bh  EOC11 is trigger for ADCINT2   0Ch  EOC12 is trigger for ADCINT2   0Dh  EOC13 is trigger for ADCINT2   0Eh  EOC14 is trigger for ADCINT2   0Fh  EOC15 is trigger for ADCINT2  10h OSINT1 is trigger for ADCINT2  11h OSINT2 is trigger for ADCINT2  12h OSINT3 is trigger for ADCINT2  13h OSINT4 is trigger for ADCINT2" range="12:8" rwaccess="R/W"/>
	<bitfield id="INT1CONT" width="1" begin="6" end="6" resetval="0x0" description="ADCINT1 Continue to Interrupt Mode   0  No further ADCINT1 pulses are generated until ADCINT1 flag [in ADCINTFLG register] is cleared by user.   1  ADCINT1 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." range="6" rwaccess="R/W"/>
	<bitfield id="INT1E" width="1" begin="5" end="5" resetval="0x0" description="ADCINT1 Interrupt Enable   0  ADCINT1 is disabled   1  ADCINT1 is enabled" range="5" rwaccess="R/W"/>
	<bitfield id="INT1SEL" width="5" begin="4" end="0" resetval="0x0" description="ADCINT1 EOC Source Select  00h EOC0 is trigger for ADCINT1  01h EOC1 is trigger for ADCINT1  02h EOC2 is trigger for ADCINT1  03h EOC3 is trigger for ADCINT1  04h EOC4 is trigger for ADCINT1  05h EOC5 is trigger for ADCINT1  06h EOC6 is trigger for ADCINT1  07h EOC7 is trigger for ADCINT1  08h EOC8 is trigger for ADCINT1  09h EOC9 is trigger for ADCINT1   0Ah  EOC10 is trigger for ADCINT1   0Bh  EOC11 is trigger for ADCINT1   0Ch  EOC12 is trigger for ADCINT1   0Dh  EOC13 is trigger for ADCINT1   0Eh  EOC14 is trigger for ADCINT1   0Fh  EOC15 is trigger for ADCINT1  10h OSINT1 is trigger for ADCINT1  11h OSINT2 is trigger for ADCINT1  12h OSINT3 is trigger for ADCINT1  13h OSINT4 is trigger for ADCINT1" range="4:0" rwaccess="R/W"/>
	</register><register id="ADC_R_CFG_ADCINTSEL3N4" acronym="ADC_R_CFG_ADCINTSEL3N4" offset="16" width="16" description="ADC Interrupt 3 and 4 Selection Register.">
		<bitfield id="INT4CONT" width="1" begin="14" end="14" resetval="0x0" description="ADCINT4 Continue to Interrupt Mode   0  No further ADCINT4 pulses are generated until ADCINT4 flag [in ADCINTFLG register] is cleared by user.   1  ADCINT4 pulses are generated whenever an EOC pulse is generated irrespective of whether the flag bit is cleared or not." range="14" rwaccess="R/W"/>
