ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/ADC_R_ADC_R_CFG_502C5000h.xml
	<bitfield id="SOC13" width="1" begin="13" end="13" resetval="0x0" description="SOC13 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC13 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.   0  No action.   1  Clear SOC13 overflow flag. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="13" rwaccess="R/W1TS"/>
	<bitfield id="SOC12" width="1" begin="12" end="12" resetval="0x0" description="SOC12 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC12 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.   0  No action.   1  Clear SOC12 overflow flag. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="12" rwaccess="R/W1TS"/>
	<bitfield id="SOC11" width="1" begin="11" end="11" resetval="0x0" description="SOC11 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC11 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.   0  No action.   1  Clear SOC11 overflow flag. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="11" rwaccess="R/W1TS"/>
	<bitfield id="SOC10" width="1" begin="10" end="10" resetval="0x0" description="SOC10 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC10 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.   0  No action.   1  Clear SOC10 overflow flag. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="10" rwaccess="R/W1TS"/>
	<bitfield id="SOC9" width="1" begin="9" end="9" resetval="0x0" description="SOC9 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC9 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.   0  No action.   1  Clear SOC9 overflow flag. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="9" rwaccess="R/W1TS"/>
	<bitfield id="SOC8" width="1" begin="8" end="8" resetval="0x0" description="SOC8 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC8 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.   0  No action.   1  Clear SOC8 overflow flag. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="8" rwaccess="R/W1TS"/>
	<bitfield id="SOC7" width="1" begin="7" end="7" resetval="0x0" description="SOC7 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC7 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.   0  No action.   1  Clear SOC7 overflow flag. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="7" rwaccess="R/W1TS"/>
	<bitfield id="SOC6" width="1" begin="6" end="6" resetval="0x0" description="SOC6 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC6 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.   0  No action.   1  Clear SOC6 overflow flag. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="6" rwaccess="R/W1TS"/>
	<bitfield id="SOC5" width="1" begin="5" end="5" resetval="0x0" description="SOC5 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC5 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.   0  No action.   1  Clear SOC5 overflow flag. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="5" rwaccess="R/W1TS"/>
	<bitfield id="SOC4" width="1" begin="4" end="4" resetval="0x0" description="SOC4 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC4 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.   0  No action.   1  Clear SOC4 overflow flag. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="4" rwaccess="R/W1TS"/>
	<bitfield id="SOC3" width="1" begin="3" end="3" resetval="0x0" description="SOC3 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC3 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.   0  No action.   1  Clear SOC3 overflow flag. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="3" rwaccess="R/W1TS"/>
	<bitfield id="SOC2" width="1" begin="2" end="2" resetval="0x0" description="SOC2 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC2 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.   0  No action.   1  Clear SOC2 overflow flag. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="2" rwaccess="R/W1TS"/>
	<bitfield id="SOC1" width="1" begin="1" end="1" resetval="0x0" description="SOC1 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC1 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.   0  No action.   1  Clear SOC1 overflow flag. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="1" rwaccess="R/W1TS"/>
	<bitfield id="SOC0" width="1" begin="0" end="0" resetval="0x0" description="SOC0 Clear Start of Conversion Overflow Bit. Writing a 1 will clear the SOC0 overflow flag in the ADCSOCOVF1 register. Writes of 0 are ignored. Reads will always return a 0.   0  No action.   1  Clear SOC0 overflow flag. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the  ADCSOCOVF1 register, then hardware has priority and the ADCSOCOVF1 bit will be set.." range="0" rwaccess="R/W1TS"/>
	</register><register id="ADC_R_CFG_ADCSOC0CTL" acronym="ADC_R_CFG_ADCSOC0CTL" offset="32" width="32" description="ADC SOC0 Control Register.">
		<bitfield id="EXTCHSEL" width="4" begin="31" end="28" resetval="0x0" description="SOC0 External Channel Mux Select. Selects the external mux combination to output  when SOC0 is received by the ADC.  Some or all of the ADCEXTMUX lines can be enabled via the device GPIO mux to control an external analog mux.    0h ADCEXTMUX[3:0] =0000 1h ADCEXTMUX[3:0] =0001 2h ADCEXTMUX[3:0] =0010 3h ADCEXTMUX[3:0] =0011 4h ADCEXTMUX[3:0] =0100 5h ADCEXTMUX[3:0] =0101 6h ADCEXTMUX[3:0] =0110 7h ADCEXTMUX[3:0] =0111 8h ADCEXTMUX[3:0] =1000 9h ADCEXTMUX[3:0] =1001  Ah  ADCEXTMUX[3:0] =1010  Bh  ADCEXTMUX[3:0] =1011  Ch  ADCEXTMUX[3:0] =1100  Dh  ADCEXTMUX[3:0] =1101  Eh  ADCEXTMUX[3:0] =1110  Fh  ADCEXTMUX[3:0] = 1111" range="31:28" rwaccess="R/W"/>
	<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC0 Trigger Source Select. Along with the SOC0 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC0 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it. Note: SOCFRC1 register can always be used to software trigger SOCs in addition to any hardware trigger configuration.  00h ADCTRIG0 - Software only  01h ADCTRIG1 - RTI0 Timer 02h ADCTRIG2 - RTI1 Timer  03h ADCTRIG3 - RTI2 Timer 04h ADCTRIG4 - RTI3 Timer 05h ADCTRIG5 - InputXBAR.Out[5] 06h ADCTRIG6 - spare  07h ADCTRIG7 - spare  08h ADCTRIG8 - EPWM0, ADCSOCA  09h ADCTRIG9 - EPWM0, ADCSOCB   0Ah  ADCTRIG10 - EPWM1, ADCSOCA   0Bh  ADCTRIG11 - EPWM1, ADCSOCB   0Ch  ADCTRIG12 - EPWM2, ADCSOCA   0Dh  ADCTRIG13 - EPWM2, ADCSOCB   0Eh  ADCTRIG14 - EPWM3, ADCSOCA   0Fh  ADCTRIG15 - EPWM3, ADCSOCB   .... EPWM4 to EPWM27 40h ADCTRIG64 - EPWM28, ADCSOCA  41h ADCTRIG65 - EPWM28, ADCSOCB  42h ADCTRIG66 - EPWM29, ADCSOCA  43h ADCTRIG67 - EPWM29, ADCSOCB  44h ADCTRIG68 - EPWM30, ADCSOCA  45h ADCTRIG69 - EPWM30, ADCSOCB  46h ADCTRIG70 - EPWM31, ADCSOCA  47h ADCTRIG71 - EPWM31, ADCSOCB  48h ADCTRIG72 - ECAP0, TRIGOUT  .... ECAP1 to ECAP8  51h ADCTRIG81 - ECAP9, TRIGOUT  52h ADCTRIG82 - ECAP10, TRIGOUT  ....  57h ADCTRIG87 - ECAP15, TRIGOUT 58h ADCTRIG88  - RTI4 Timer  59h ADCTRIG89  - RTI5 Timer   5Ah  ADCTRIG90  - RTI6 Timer   5Bh  ADCTRIG91  - RTI7 Timer  ....    7Fh  ADCTRIG127 - REP2TRIG - these are not external trigger signals on the ADC IP port. We need to configure them for internal selection of repeater triggers.  " range="26:20" rwaccess="R/W"/>
	<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC0 Channel Select. Selects the channel to be converted when SOC0 is received by the ADC. Single-ended Signaling Mode [SIGNALMODE = 0]:  00h ADCIN0  01h ADCIN1  02h ADCIN2  03h ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31 Differential Signaling Mode [SIGNALMODE = 1]:  00h ADCIN0 [non-inverting] and ADCIN1 [inverting]  01h ADCIN0 [non-inverting] and ADCIN1 [inverting]  02h ADCIN2 [non-inverting] and ADCIN3 [inverting]  03h ADCIN2 [non-inverting] and ADCIN3 [inverting]  04h ADCIN4 [non-inverting] and ADCIN5 [inverting]  05h ADCIN4 [non-inverting] and ADCIN5 [inverting]   ...   0Eh  ADCIN26 [non-inverting] and ADCIN27 [inverting]   0Fh  ADCIN26 [non-inverting] and ADCIN27 [inverting]  10h ADCIN28 [non-inverting] and ADCIN29 [inverting]  11h ADCIN28 [non-inverting] and ADCIN29 [inverting]   1Eh  ADCIN30 [non-inverting] and ADCIN31 [inverting]   1Fh  ADCIN30 [non-inverting] and ADCIN31 [inverting]" range="19:15" rwaccess="R/W"/>
	<bitfield id="RESOLUTION" width="3" begin="14" end="12" resetval="0x0" description="Placeholder for per-SOC resolution" range="14:12" rwaccess="R"/>
	<bitfield id="SIGNALMODE" width="2" begin="11" end="10" resetval="0x0" description="Placeholder for per-SOC signal mode" range="11:10" rwaccess="R"/>
	<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC0 Acquisition Prescale. Controls the sample and hold window for this SOC.     000h Reserved  001h Reserved  002h Sample window is 3 system clock cycles wide  003h Sample window is 4 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The configured acquisition time must also be at least 3 SYSCLK cycles long. The device datasheet will also specify a minimum sample and hold window duration." range="8:0" rwaccess="R/W"/>
	</register><register id="ADC_R_CFG_ADCSOC1CTL" acronym="ADC_R_CFG_ADCSOC1CTL" offset="36" width="32" description="ADC SOC1 Control Register.">
		<bitfield id="EXTCHSEL" width="4" begin="31" end="28" resetval="0x0" description="SOC1 External Channel Mux Select. Selects the external mux combination to output  when SOC1 is received by the ADC.  Some or all of the ADCEXTMUX lines can be enabled via the device GPIO mux to control an external analog mux.    0h ADCEXTMUX[3:0] =0000 1h ADCEXTMUX[3:0] =0001 2h ADCEXTMUX[3:0] =0010 3h ADCEXTMUX[3:0] =0011 4h ADCEXTMUX[3:0] =0100 5h ADCEXTMUX[3:0] =0101 6h ADCEXTMUX[3:0] =0110 7h ADCEXTMUX[3:0] =0111 8h ADCEXTMUX[3:0] =1000 9h ADCEXTMUX[3:0] =1001  Ah  ADCEXTMUX[3:0] =1010  Bh  ADCEXTMUX[3:0] =1011  Ch  ADCEXTMUX[3:0] =1100  Dh  ADCEXTMUX[3:0] =1101  Eh  ADCEXTMUX[3:0] =1110  Fh  ADCEXTMUX[3:0] = 1111" range="31:28" rwaccess="R/W"/>
	<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC1 Trigger Source Select. Along with the SOC1 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC1 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it. Note: SOCFRC1 register can always be used to software trigger SOCs in addition to any hardware trigger configuration.  00h ADCTRIG0 - Software only  01h ADCTRIG1 - RTI0 Timer 02h ADCTRIG2 - RTI1 Timer  03h ADCTRIG3 - RTI2 Timer 04h ADCTRIG4 - RTI3 Timer 05h ADCTRIG5 - InputXBAR.Out[5] 06h ADCTRIG6 - spare  07h ADCTRIG7 - spare  08h ADCTRIG8 - EPWM0, ADCSOCA  09h ADCTRIG9 - EPWM0, ADCSOCB   0Ah  ADCTRIG10 - EPWM1, ADCSOCA   0Bh  ADCTRIG11 - EPWM1, ADCSOCB   0Ch  ADCTRIG12 - EPWM2, ADCSOCA   0Dh  ADCTRIG13 - EPWM2, ADCSOCB   0Eh  ADCTRIG14 - EPWM3, ADCSOCA   0Fh  ADCTRIG15 - EPWM3, ADCSOCB   .... EPWM4 to EPWM27 40h ADCTRIG64 - EPWM28, ADCSOCA  41h ADCTRIG65 - EPWM28, ADCSOCB  42h ADCTRIG66 - EPWM29, ADCSOCA  43h ADCTRIG67 - EPWM29, ADCSOCB  44h ADCTRIG68 - EPWM30, ADCSOCA  45h ADCTRIG69 - EPWM30, ADCSOCB  46h ADCTRIG70 - EPWM31, ADCSOCA  47h ADCTRIG71 - EPWM31, ADCSOCB  48h ADCTRIG72 - ECAP0, TRIGOUT  .... ECAP1 to ECAP8  51h ADCTRIG81 - ECAP9, TRIGOUT  52h ADCTRIG82 - ECAP10, TRIGOUT  ....  57h ADCTRIG87 - ECAP15, TRIGOUT 58h ADCTRIG88  - RTI4 Timer  59h ADCTRIG89  - RTI5 Timer   5Ah  ADCTRIG90  - RTI6 Timer   5Bh  ADCTRIG91  - RTI7 Timer   ....    7Fh  ADCTRIG127 - REP2TRIG - these are not external trigger signals on the ADC IP port. We need to configure them for internal selection of repeater triggers.  " range="26:20" rwaccess="R/W"/>
	<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC1 Channel Select. Selects the channel to be converted when SOC1 is received by the ADC. Single-ended Signaling Mode [SIGNALMODE = 0]:  00h ADCIN0  01h ADCIN1  02h ADCIN2  03h ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31 Differential Signaling Mode [SIGNALMODE = 1]:  00h ADCIN0 [non-inverting] and ADCIN1 [inverting]  01h ADCIN0 [non-inverting] and ADCIN1 [inverting]  02h ADCIN2 [non-inverting] and ADCIN3 [inverting]  03h ADCIN2 [non-inverting] and ADCIN3 [inverting]  04h ADCIN4 [non-inverting] and ADCIN5 [inverting]  05h ADCIN4 [non-inverting] and ADCIN5 [inverting]   ...   0Eh  ADCIN26 [non-inverting] and ADCIN27 [inverting]   0Fh  ADCIN26 [non-inverting] and ADCIN27 [inverting]  10h ADCIN28 [non-inverting] and ADCIN29 [inverting]  11h ADCIN28 [non-inverting] and ADCIN29 [inverting]   1Eh  ADCIN30 [non-inverting] and ADCIN31 [inverting]   1Fh  ADCIN30 [non-inverting] and ADCIN31 [inverting]" range="19:15" rwaccess="R/W"/>
	<bitfield id="RESOLUTION" width="3" begin="14" end="12" resetval="0x0" description="Placeholder for per-SOC resolution" range="14:12" rwaccess="R"/>
	<bitfield id="SIGNALMODE" width="2" begin="11" end="10" resetval="0x0" description="Placeholder for per-SOC signal mode" range="11:10" rwaccess="R"/>
	<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC1 Acquisition Prescale. Controls the sample and hold window for this SOC.     000h Reserved  001h Reserved  002h Sample window is 3 system clock cycles wide  003h Sample window is 4 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The configured acquisition time must also be at least 3 SYSCLK cycles long. The device datasheet will also specify a minimum sample and hold window duration." range="8:0" rwaccess="R/W"/>
	</register><register id="ADC_R_CFG_ADCSOC2CTL" acronym="ADC_R_CFG_ADCSOC2CTL" offset="40" width="32" description="ADC SOC2 Control Register.">
		<bitfield id="EXTCHSEL" width="4" begin="31" end="28" resetval="0x0" description="SOC2 External Channel Mux Select. Selects the external mux combination to output  when SOC2 is received by the ADC.  Some or all of the ADCEXTMUX lines can be enabled via the device GPIO mux to control an external analog mux.    0h ADCEXTMUX[3:0] =0000 1h ADCEXTMUX[3:0] =0001 2h ADCEXTMUX[3:0] =0010 3h ADCEXTMUX[3:0] =0011 4h ADCEXTMUX[3:0] =0100 5h ADCEXTMUX[3:0] =0101 6h ADCEXTMUX[3:0] =0110 7h ADCEXTMUX[3:0] =0111 8h ADCEXTMUX[3:0] =1000 9h ADCEXTMUX[3:0] =1001  Ah  ADCEXTMUX[3:0] =1010  Bh  ADCEXTMUX[3:0] =1011  Ch  ADCEXTMUX[3:0] =1100  Dh  ADCEXTMUX[3:0] =1101  Eh  ADCEXTMUX[3:0] =1110  Fh  ADCEXTMUX[3:0] = 1111" range="31:28" rwaccess="R/W"/>
	<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC2 Trigger Source Select. Along with the SOC2 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC2 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it. Note: SOCFRC1 register can always be used to software trigger SOCs in addition to any hardware trigger configuration.  00h ADCTRIG0 - Software only  01h ADCTRIG1 - RTI0 Timer 02h ADCTRIG2 - RTI1 Timer  03h ADCTRIG3 - RTI2 Timer 04h ADCTRIG4 - RTI3 Timer 05h ADCTRIG5 - InputXBAR.Out[5] 06h ADCTRIG6 - spare  07h ADCTRIG7 - spare  08h ADCTRIG8 - EPWM0, ADCSOCA  09h ADCTRIG9 - EPWM0, ADCSOCB   0Ah  ADCTRIG10 - EPWM1, ADCSOCA   0Bh  ADCTRIG11 - EPWM1, ADCSOCB   0Ch  ADCTRIG12 - EPWM2, ADCSOCA   0Dh  ADCTRIG13 - EPWM2, ADCSOCB   0Eh  ADCTRIG14 - EPWM3, ADCSOCA   0Fh  ADCTRIG15 - EPWM3, ADCSOCB   .... EPWM4 to EPWM27 40h ADCTRIG64 - EPWM28, ADCSOCA  41h ADCTRIG65 - EPWM28, ADCSOCB  42h ADCTRIG66 - EPWM29, ADCSOCA  43h ADCTRIG67 - EPWM29, ADCSOCB  44h ADCTRIG68 - EPWM30, ADCSOCA  45h ADCTRIG69 - EPWM30, ADCSOCB  46h ADCTRIG70 - EPWM31, ADCSOCA  47h ADCTRIG71 - EPWM31, ADCSOCB  48h ADCTRIG72 - ECAP0, TRIGOUT  .... ECAP1 to ECAP8  51h ADCTRIG81 - ECAP9, TRIGOUT  52h ADCTRIG82 - ECAP10, TRIGOUT  ....  57h ADCTRIG87 - ECAP15, TRIGOUT 58h ADCTRIG88  - RTI4 Timer  59h ADCTRIG89  - RTI5 Timer   5Ah  ADCTRIG90  - RTI6 Timer   5Bh  ADCTRIG91  - RTI7 Timer  ....    7Fh  ADCTRIG127 - REP2TRIG - these are not external trigger signals on the ADC IP port. We need to configure them for internal selection of repeater triggers.   " range="26:20" rwaccess="R/W"/>
	<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC2 Channel Select. Selects the channel to be converted when SOC2 is received by the ADC. Single-ended Signaling Mode [SIGNALMODE = 0]:  00h ADCIN0  01h ADCIN1  02h ADCIN2  03h ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31 Differential Signaling Mode [SIGNALMODE = 1]:  00h ADCIN0 [non-inverting] and ADCIN1 [inverting]  01h ADCIN0 [non-inverting] and ADCIN1 [inverting]  02h ADCIN2 [non-inverting] and ADCIN3 [inverting]  03h ADCIN2 [non-inverting] and ADCIN3 [inverting]  04h ADCIN4 [non-inverting] and ADCIN5 [inverting]  05h ADCIN4 [non-inverting] and ADCIN5 [inverting]   ...   0Eh  ADCIN26 [non-inverting] and ADCIN27 [inverting]   0Fh  ADCIN26 [non-inverting] and ADCIN27 [inverting]  10h ADCIN28 [non-inverting] and ADCIN29 [inverting]  11h ADCIN28 [non-inverting] and ADCIN29 [inverting]   1Eh  ADCIN30 [non-inverting] and ADCIN31 [inverting]   1Fh  ADCIN30 [non-inverting] and ADCIN31 [inverting]" range="19:15" rwaccess="R/W"/>
	<bitfield id="RESOLUTION" width="3" begin="14" end="12" resetval="0x0" description="Placeholder for per-SOC resolution" range="14:12" rwaccess="R"/>
	<bitfield id="SIGNALMODE" width="2" begin="11" end="10" resetval="0x0" description="Placeholder for per-SOC signal mode" range="11:10" rwaccess="R"/>
	<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC2 Acquisition Prescale. Controls the sample and hold window for this SOC.     000h Reserved  001h Reserved  002h Sample window is 3 system clock cycles wide  003h Sample window is 4 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The configured acquisition time must also be at least 3 SYSCLK cycles long. The device datasheet will also specify a minimum sample and hold window duration." range="8:0" rwaccess="R/W"/>
	</register><register id="ADC_R_CFG_ADCSOC3CTL" acronym="ADC_R_CFG_ADCSOC3CTL" offset="44" width="32" description="ADC SOC3 Control Register.">
		<bitfield id="EXTCHSEL" width="4" begin="31" end="28" resetval="0x0" description="SOC3 External Channel Mux Select. Selects the external mux combination to output  when SOC3 is received by the ADC.  Some or all of the ADCEXTMUX lines can be enabled via the device GPIO mux to control an external analog mux.    0h ADCEXTMUX[3:0] =0000 1h ADCEXTMUX[3:0] =0001 2h ADCEXTMUX[3:0] =0010 3h ADCEXTMUX[3:0] =0011 4h ADCEXTMUX[3:0] =0100 5h ADCEXTMUX[3:0] =0101 6h ADCEXTMUX[3:0] =0110 7h ADCEXTMUX[3:0] =0111 8h ADCEXTMUX[3:0] =1000 9h ADCEXTMUX[3:0] =1001  Ah  ADCEXTMUX[3:0] =1010  Bh  ADCEXTMUX[3:0] =1011  Ch  ADCEXTMUX[3:0] =1100  Dh  ADCEXTMUX[3:0] =1101  Eh  ADCEXTMUX[3:0] =1110  Fh  ADCEXTMUX[3:0] = 1111" range="31:28" rwaccess="R/W"/>
	<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC3 Trigger Source Select. Along with the SOC3 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC3 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it. Note: SOCFRC1 register can always be used to software trigger SOCs in addition to any hardware trigger configuration.  00h ADCTRIG0 - Software only  01h ADCTRIG1 - RTI0 Timer 02h ADCTRIG2 - RTI1 Timer  03h ADCTRIG3 - RTI2 Timer 04h ADCTRIG4 - RTI3 Timer 05h ADCTRIG5 - InputXBAR.Out[5] 06h ADCTRIG6 - spare  07h ADCTRIG7 - spare  08h ADCTRIG8 - EPWM0, ADCSOCA  09h ADCTRIG9 - EPWM0, ADCSOCB   0Ah  ADCTRIG10 - EPWM1, ADCSOCA   0Bh  ADCTRIG11 - EPWM1, ADCSOCB   0Ch  ADCTRIG12 - EPWM2, ADCSOCA   0Dh  ADCTRIG13 - EPWM2, ADCSOCB   0Eh  ADCTRIG14 - EPWM3, ADCSOCA   0Fh  ADCTRIG15 - EPWM3, ADCSOCB   .... EPWM4 to EPWM27 40h ADCTRIG64 - EPWM28, ADCSOCA  41h ADCTRIG65 - EPWM28, ADCSOCB  42h ADCTRIG66 - EPWM29, ADCSOCA  43h ADCTRIG67 - EPWM29, ADCSOCB  44h ADCTRIG68 - EPWM30, ADCSOCA  45h ADCTRIG69 - EPWM30, ADCSOCB  46h ADCTRIG70 - EPWM31, ADCSOCA  47h ADCTRIG71 - EPWM31, ADCSOCB  48h ADCTRIG72 - ECAP0, TRIGOUT  .... ECAP1 to ECAP8  51h ADCTRIG81 - ECAP9, TRIGOUT  52h ADCTRIG82 - ECAP10, TRIGOUT  ....  57h ADCTRIG87 - ECAP15, TRIGOUT 58h ADCTRIG88  - RTI4 Timer  59h ADCTRIG89  - RTI5 Timer   5Ah  ADCTRIG90  - RTI6 Timer   5Bh  ADCTRIG91  - RTI7 Timer  ....    7Fh  ADCTRIG127 - REP2TRIG - these are not external trigger signals on the ADC IP port. We need to configure them for internal selection of repeater triggers.  " range="26:20" rwaccess="R/W"/>
