ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/ADC_R_ADC_R_CFG_502C5000h.xml
	<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC3 Channel Select. Selects the channel to be converted when SOC3 is received by the ADC. Single-ended Signaling Mode [SIGNALMODE = 0]:  00h ADCIN0  01h ADCIN1  02h ADCIN2  03h ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31 Differential Signaling Mode [SIGNALMODE = 1]:  00h ADCIN0 [non-inverting] and ADCIN1 [inverting]  01h ADCIN0 [non-inverting] and ADCIN1 [inverting]  02h ADCIN2 [non-inverting] and ADCIN3 [inverting]  03h ADCIN2 [non-inverting] and ADCIN3 [inverting]  04h ADCIN4 [non-inverting] and ADCIN5 [inverting]  05h ADCIN4 [non-inverting] and ADCIN5 [inverting]   ...   0Eh  ADCIN26 [non-inverting] and ADCIN27 [inverting]   0Fh  ADCIN26 [non-inverting] and ADCIN27 [inverting]  10h ADCIN28 [non-inverting] and ADCIN29 [inverting]  11h ADCIN28 [non-inverting] and ADCIN29 [inverting]   1Eh  ADCIN30 [non-inverting] and ADCIN31 [inverting]   1Fh  ADCIN30 [non-inverting] and ADCIN31 [inverting]" range="19:15" rwaccess="R/W"/>
	<bitfield id="RESOLUTION" width="3" begin="14" end="12" resetval="0x0" description="Placeholder for per-SOC resolution" range="14:12" rwaccess="R"/>
	<bitfield id="SIGNALMODE" width="2" begin="11" end="10" resetval="0x0" description="Placeholder for per-SOC signal mode" range="11:10" rwaccess="R"/>
	<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC3 Acquisition Prescale. Controls the sample and hold window for this SOC.     000h Reserved  001h Reserved  002h Sample window is 3 system clock cycles wide  003h Sample window is 4 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The configured acquisition time must also be at least 3 SYSCLK cycles long. The device datasheet will also specify a minimum sample and hold window duration." range="8:0" rwaccess="R/W"/>
	</register><register id="ADC_R_CFG_ADCSOC4CTL" acronym="ADC_R_CFG_ADCSOC4CTL" offset="48" width="32" description="ADC SOC4 Control Register.">
		<bitfield id="EXTCHSEL" width="4" begin="31" end="28" resetval="0x0" description="SOC4 External Channel Mux Select. Selects the external mux combination to output  when SOC4 is received by the ADC.  Some or all of the ADCEXTMUX lines can be enabled via the device GPIO mux to control an external analog mux.    0h ADCEXTMUX[3:0] =0000 1h ADCEXTMUX[3:0] =0001 2h ADCEXTMUX[3:0] =0010 3h ADCEXTMUX[3:0] =0011 4h ADCEXTMUX[3:0] =0100 5h ADCEXTMUX[3:0] =0101 6h ADCEXTMUX[3:0] =0110 7h ADCEXTMUX[3:0] =0111 8h ADCEXTMUX[3:0] =1000 9h ADCEXTMUX[3:0] =1001  Ah  ADCEXTMUX[3:0] =1010  Bh  ADCEXTMUX[3:0] =1011  Ch  ADCEXTMUX[3:0] =1100  Dh  ADCEXTMUX[3:0] =1101  Eh  ADCEXTMUX[3:0] =1110  Fh  ADCEXTMUX[3:0] = 1111" range="31:28" rwaccess="R/W"/>
	<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC4 Trigger Source Select. Along with the SOC4 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC4 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it. Note: SOCFRC1 register can always be used to software trigger SOCs in addition to any hardware trigger configuration.  00h ADCTRIG0 - Software only  01h ADCTRIG1 - RTI0 Timer 02h ADCTRIG2 - RTI1 Timer  03h ADCTRIG3 - RTI2 Timer 04h ADCTRIG4 - RTI3 Timer 05h ADCTRIG5 - InputXBAR.Out[5] 06h ADCTRIG6 - spare  07h ADCTRIG7 - spare  08h ADCTRIG8 - EPWM0, ADCSOCA  09h ADCTRIG9 - EPWM0, ADCSOCB   0Ah  ADCTRIG10 - EPWM1, ADCSOCA   0Bh  ADCTRIG11 - EPWM1, ADCSOCB   0Ch  ADCTRIG12 - EPWM2, ADCSOCA   0Dh  ADCTRIG13 - EPWM2, ADCSOCB   0Eh  ADCTRIG14 - EPWM3, ADCSOCA   0Fh  ADCTRIG15 - EPWM3, ADCSOCB   .... EPWM4 to EPWM27 40h ADCTRIG64 - EPWM28, ADCSOCA  41h ADCTRIG65 - EPWM28, ADCSOCB  42h ADCTRIG66 - EPWM29, ADCSOCA  43h ADCTRIG67 - EPWM29, ADCSOCB  44h ADCTRIG68 - EPWM30, ADCSOCA  45h ADCTRIG69 - EPWM30, ADCSOCB  46h ADCTRIG70 - EPWM31, ADCSOCA  47h ADCTRIG71 - EPWM31, ADCSOCB  48h ADCTRIG72 - ECAP0, TRIGOUT  .... ECAP1 to ECAP8  51h ADCTRIG81 - ECAP9, TRIGOUT  52h ADCTRIG82 - ECAP10, TRIGOUT  ....  57h ADCTRIG87 - ECAP15, TRIGOUT 58h ADCTRIG88  - RTI4 Timer  59h ADCTRIG89  - RTI5 Timer   5Ah  ADCTRIG90  - RTI6 Timer   5Bh  ADCTRIG91  - RTI7 Timer  ....    7Fh  ADCTRIG127 - REP2TRIG - these are not external trigger signals on the ADC IP port. We need to configure them for internal selection of repeater triggers.  " range="26:20" rwaccess="R/W"/>
	<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC4 Channel Select. Selects the channel to be converted when SOC4 is received by the ADC. Single-ended Signaling Mode [SIGNALMODE = 0]:  00h ADCIN0  01h ADCIN1  02h ADCIN2  03h ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31 Differential Signaling Mode [SIGNALMODE = 1]:  00h ADCIN0 [non-inverting] and ADCIN1 [inverting]  01h ADCIN0 [non-inverting] and ADCIN1 [inverting]  02h ADCIN2 [non-inverting] and ADCIN3 [inverting]  03h ADCIN2 [non-inverting] and ADCIN3 [inverting]  04h ADCIN4 [non-inverting] and ADCIN5 [inverting]  05h ADCIN4 [non-inverting] and ADCIN5 [inverting]   ...   0Eh  ADCIN26 [non-inverting] and ADCIN27 [inverting]   0Fh  ADCIN26 [non-inverting] and ADCIN27 [inverting]  10h ADCIN28 [non-inverting] and ADCIN29 [inverting]  11h ADCIN28 [non-inverting] and ADCIN29 [inverting]   1Eh  ADCIN30 [non-inverting] and ADCIN31 [inverting]   1Fh  ADCIN30 [non-inverting] and ADCIN31 [inverting]" range="19:15" rwaccess="R/W"/>
	<bitfield id="RESOLUTION" width="3" begin="14" end="12" resetval="0x0" description="Placeholder for per-SOC resolution" range="14:12" rwaccess="R"/>
	<bitfield id="SIGNALMODE" width="2" begin="11" end="10" resetval="0x0" description="Placeholder for per-SOC signal mode" range="11:10" rwaccess="R"/>
	<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC4 Acquisition Prescale. Controls the sample and hold window for this SOC.     000h Reserved  001h Reserved  002h Sample window is 3 system clock cycles wide  003h Sample window is 4 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The configured acquisition time must also be at least 3 SYSCLK cycles long. The device datasheet will also specify a minimum sample and hold window duration." range="8:0" rwaccess="R/W"/>
	</register><register id="ADC_R_CFG_ADCSOC5CTL" acronym="ADC_R_CFG_ADCSOC5CTL" offset="52" width="32" description="ADC SOC5 Control Register.">
		<bitfield id="EXTCHSEL" width="4" begin="31" end="28" resetval="0x0" description="SOC5 External Channel Mux Select. Selects the external mux combination to output  when SOC5 is received by the ADC.  Some or all of the ADCEXTMUX lines can be enabled via the device GPIO mux to control an external analog mux.    0h ADCEXTMUX[3:0] =0000 1h ADCEXTMUX[3:0] =0001 2h ADCEXTMUX[3:0] =0010 3h ADCEXTMUX[3:0] =0011 4h ADCEXTMUX[3:0] =0100 5h ADCEXTMUX[3:0] =0101 6h ADCEXTMUX[3:0] =0110 7h ADCEXTMUX[3:0] =0111 8h ADCEXTMUX[3:0] =1000 9h ADCEXTMUX[3:0] =1001  Ah  ADCEXTMUX[3:0] =1010  Bh  ADCEXTMUX[3:0] =1011  Ch  ADCEXTMUX[3:0] =1100  Dh  ADCEXTMUX[3:0] =1101  Eh  ADCEXTMUX[3:0] =1110  Fh  ADCEXTMUX[3:0] = 1111" range="31:28" rwaccess="R/W"/>
	<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC5 Trigger Source Select. Along with the SOC5 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC5 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it. Note: SOCFRC1 register can always be used to software trigger SOCs in addition to any hardware trigger configuration.  00h ADCTRIG0 - Software only  01h ADCTRIG1 - RTI0 Timer 02h ADCTRIG2 - RTI1 Timer  03h ADCTRIG3 - RTI2 Timer 04h ADCTRIG4 - RTI3 Timer 05h ADCTRIG5 - InputXBAR.Out[5] 06h ADCTRIG6 - spare  07h ADCTRIG7 - spare  08h ADCTRIG8 - EPWM0, ADCSOCA  09h ADCTRIG9 - EPWM0, ADCSOCB   0Ah  ADCTRIG10 - EPWM1, ADCSOCA   0Bh  ADCTRIG11 - EPWM1, ADCSOCB   0Ch  ADCTRIG12 - EPWM2, ADCSOCA   0Dh  ADCTRIG13 - EPWM2, ADCSOCB   0Eh  ADCTRIG14 - EPWM3, ADCSOCA   0Fh  ADCTRIG15 - EPWM3, ADCSOCB   .... EPWM4 to EPWM27 40h ADCTRIG64 - EPWM28, ADCSOCA  41h ADCTRIG65 - EPWM28, ADCSOCB  42h ADCTRIG66 - EPWM29, ADCSOCA  43h ADCTRIG67 - EPWM29, ADCSOCB  44h ADCTRIG68 - EPWM30, ADCSOCA  45h ADCTRIG69 - EPWM30, ADCSOCB  46h ADCTRIG70 - EPWM31, ADCSOCA  47h ADCTRIG71 - EPWM31, ADCSOCB  48h ADCTRIG72 - ECAP0, TRIGOUT  .... ECAP1 to ECAP8  51h ADCTRIG81 - ECAP9, TRIGOUT  52h ADCTRIG82 - ECAP10, TRIGOUT  ....  57h ADCTRIG87 - ECAP15, TRIGOUT 58h ADCTRIG88  - RTI4 Timer  59h ADCTRIG89  - RTI5 Timer   5Ah  ADCTRIG90  - RTI6 Timer   5Bh  ADCTRIG91  - RTI7 Timer  ....    7Fh  ADCTRIG127 - REP2TRIG - these are not external trigger signals on the ADC IP port. We need to configure them for internal selection of repeater triggers.  " range="26:20" rwaccess="R/W"/>
	<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC5 Channel Select. Selects the channel to be converted when SOC5 is received by the ADC. Single-ended Signaling Mode [SIGNALMODE = 0]:  00h ADCIN0  01h ADCIN1  02h ADCIN2  03h ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31 Differential Signaling Mode [SIGNALMODE = 1]:  00h ADCIN0 [non-inverting] and ADCIN1 [inverting]  01h ADCIN0 [non-inverting] and ADCIN1 [inverting]  02h ADCIN2 [non-inverting] and ADCIN3 [inverting]  03h ADCIN2 [non-inverting] and ADCIN3 [inverting]  04h ADCIN4 [non-inverting] and ADCIN5 [inverting]  05h ADCIN4 [non-inverting] and ADCIN5 [inverting]   ...   0Eh  ADCIN26 [non-inverting] and ADCIN27 [inverting]   0Fh  ADCIN26 [non-inverting] and ADCIN27 [inverting]  10h ADCIN28 [non-inverting] and ADCIN29 [inverting]  11h ADCIN28 [non-inverting] and ADCIN29 [inverting]   1Eh  ADCIN30 [non-inverting] and ADCIN31 [inverting]   1Fh  ADCIN30 [non-inverting] and ADCIN31 [inverting]" range="19:15" rwaccess="R/W"/>
	<bitfield id="RESOLUTION" width="3" begin="14" end="12" resetval="0x0" description="Placeholder for per-SOC resolution" range="14:12" rwaccess="R"/>
	<bitfield id="SIGNALMODE" width="2" begin="11" end="10" resetval="0x0" description="Placeholder for per-SOC signal mode" range="11:10" rwaccess="R"/>
	<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC5 Acquisition Prescale. Controls the sample and hold window for this SOC.     000h Reserved  001h Reserved  002h Sample window is 3 system clock cycles wide  003h Sample window is 4 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The configured acquisition time must also be at least 3 SYSCLK cycles long. The device datasheet will also specify a minimum sample and hold window duration." range="8:0" rwaccess="R/W"/>
	</register><register id="ADC_R_CFG_ADCSOC6CTL" acronym="ADC_R_CFG_ADCSOC6CTL" offset="56" width="32" description="ADC SOC6 Control Register.">
		<bitfield id="EXTCHSEL" width="4" begin="31" end="28" resetval="0x0" description="SOC6 External Channel Mux Select. Selects the external mux combination to output  when SOC6 is received by the ADC.  Some or all of the ADCEXTMUX lines can be enabled via the device GPIO mux to control an external analog mux.    0h ADCEXTMUX[3:0] =0000 1h ADCEXTMUX[3:0] =0001 2h ADCEXTMUX[3:0] =0010 3h ADCEXTMUX[3:0] =0011 4h ADCEXTMUX[3:0] =0100 5h ADCEXTMUX[3:0] =0101 6h ADCEXTMUX[3:0] =0110 7h ADCEXTMUX[3:0] =0111 8h ADCEXTMUX[3:0] =1000 9h ADCEXTMUX[3:0] =1001  Ah  ADCEXTMUX[3:0] =1010  Bh  ADCEXTMUX[3:0] =1011  Ch  ADCEXTMUX[3:0] =1100  Dh  ADCEXTMUX[3:0] =1101  Eh  ADCEXTMUX[3:0] =1110  Fh  ADCEXTMUX[3:0] = 1111" range="31:28" rwaccess="R/W"/>
	<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC6 Trigger Source Select. Along with the SOC6 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC6 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it. Note: SOCFRC1 register can always be used to software trigger SOCs in addition to any hardware trigger configuration.  00h ADCTRIG0 - Software only  01h ADCTRIG1 - RTI0 Timer 02h ADCTRIG2 - RTI1 Timer  03h ADCTRIG3 - RTI2 Timer 04h ADCTRIG4 - RTI3 Timer 05h ADCTRIG5 - InputXBAR.Out[5] 06h ADCTRIG6 - spare  07h ADCTRIG7 - spare  08h ADCTRIG8 - EPWM0, ADCSOCA  09h ADCTRIG9 - EPWM0, ADCSOCB   0Ah  ADCTRIG10 - EPWM1, ADCSOCA   0Bh  ADCTRIG11 - EPWM1, ADCSOCB   0Ch  ADCTRIG12 - EPWM2, ADCSOCA   0Dh  ADCTRIG13 - EPWM2, ADCSOCB   0Eh  ADCTRIG14 - EPWM3, ADCSOCA   0Fh  ADCTRIG15 - EPWM3, ADCSOCB   .... EPWM4 to EPWM27 40h ADCTRIG64 - EPWM28, ADCSOCA  41h ADCTRIG65 - EPWM28, ADCSOCB  42h ADCTRIG66 - EPWM29, ADCSOCA  43h ADCTRIG67 - EPWM29, ADCSOCB  44h ADCTRIG68 - EPWM30, ADCSOCA  45h ADCTRIG69 - EPWM30, ADCSOCB  46h ADCTRIG70 - EPWM31, ADCSOCA  47h ADCTRIG71 - EPWM31, ADCSOCB  48h ADCTRIG72 - ECAP0, TRIGOUT  .... ECAP1 to ECAP8  51h ADCTRIG81 - ECAP9, TRIGOUT  52h ADCTRIG82 - ECAP10, TRIGOUT  ....  57h ADCTRIG87 - ECAP15, TRIGOUT 58h ADCTRIG88  - RTI4 Timer  59h ADCTRIG89  - RTI5 Timer   5Ah  ADCTRIG90  - RTI6 Timer   5Bh  ADCTRIG91  - RTI7 Timer  ....    7Fh  ADCTRIG127 - REP2TRIG - these are not external trigger signals on the ADC IP port. We need to configure them for internal selection of repeater triggers.  " range="26:20" rwaccess="R/W"/>
	<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC6 Channel Select. Selects the channel to be converted when SOC6 is received by the ADC. Single-ended Signaling Mode [SIGNALMODE = 0]:  00h ADCIN0  01h ADCIN1  02h ADCIN2  03h ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31 Differential Signaling Mode [SIGNALMODE = 1]:  00h ADCIN0 [non-inverting] and ADCIN1 [inverting]  01h ADCIN0 [non-inverting] and ADCIN1 [inverting]  02h ADCIN2 [non-inverting] and ADCIN3 [inverting]  03h ADCIN2 [non-inverting] and ADCIN3 [inverting]  04h ADCIN4 [non-inverting] and ADCIN5 [inverting]  05h ADCIN4 [non-inverting] and ADCIN5 [inverting]   ...   0Eh  ADCIN26 [non-inverting] and ADCIN27 [inverting]   0Fh  ADCIN26 [non-inverting] and ADCIN27 [inverting]  10h ADCIN28 [non-inverting] and ADCIN29 [inverting]  11h ADCIN28 [non-inverting] and ADCIN29 [inverting]   1Eh  ADCIN30 [non-inverting] and ADCIN31 [inverting]   1Fh  ADCIN30 [non-inverting] and ADCIN31 [inverting]" range="19:15" rwaccess="R/W"/>
	<bitfield id="RESOLUTION" width="3" begin="14" end="12" resetval="0x0" description="Placeholder for per-SOC resolution" range="14:12" rwaccess="R"/>
	<bitfield id="SIGNALMODE" width="2" begin="11" end="10" resetval="0x0" description="Placeholder for per-SOC signal mode" range="11:10" rwaccess="R"/>
	<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC6 Acquisition Prescale. Controls the sample and hold window for this SOC.     000h Reserved  001h Reserved  002h Sample window is 3 system clock cycles wide  003h Sample window is 4 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The configured acquisition time must also be at least 3 SYSCLK cycles long. The device datasheet will also specify a minimum sample and hold window duration." range="8:0" rwaccess="R/W"/>
	</register><register id="ADC_R_CFG_ADCSOC7CTL" acronym="ADC_R_CFG_ADCSOC7CTL" offset="60" width="32" description="ADC SOC7 Control Register.">
		<bitfield id="EXTCHSEL" width="4" begin="31" end="28" resetval="0x0" description="SOC7 External Channel Mux Select. Selects the external mux combination to output  when SOC7 is received by the ADC.  Some or all of the ADCEXTMUX lines can be enabled via the device GPIO mux to control an external analog mux.    0h ADCEXTMUX[3:0] =0000 1h ADCEXTMUX[3:0] =0001 2h ADCEXTMUX[3:0] =0010 3h ADCEXTMUX[3:0] =0011 4h ADCEXTMUX[3:0] =0100 5h ADCEXTMUX[3:0] =0101 6h ADCEXTMUX[3:0] =0110 7h ADCEXTMUX[3:0] =0111 8h ADCEXTMUX[3:0] =1000 9h ADCEXTMUX[3:0] =1001  Ah  ADCEXTMUX[3:0] =1010  Bh  ADCEXTMUX[3:0] =1011  Ch  ADCEXTMUX[3:0] =1100  Dh  ADCEXTMUX[3:0] =1101  Eh  ADCEXTMUX[3:0] =1110  Fh  ADCEXTMUX[3:0] = 1111" range="31:28" rwaccess="R/W"/>
	<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC7 Trigger Source Select. Along with the SOC7 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC7 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it. Note: SOCFRC1 register can always be used to software trigger SOCs in addition to any hardware trigger configuration.  00h ADCTRIG0 - Software only  01h ADCTRIG1 - RTI0 Timer 02h ADCTRIG2 - RTI1 Timer  03h ADCTRIG3 - RTI2 Timer 04h ADCTRIG4 - RTI3 Timer 05h ADCTRIG5 - InputXBAR.Out[5] 06h ADCTRIG6 - spare  07h ADCTRIG7 - spare  08h ADCTRIG8 - EPWM0, ADCSOCA  09h ADCTRIG9 - EPWM0, ADCSOCB   0Ah  ADCTRIG10 - EPWM1, ADCSOCA   0Bh  ADCTRIG11 - EPWM1, ADCSOCB   0Ch  ADCTRIG12 - EPWM2, ADCSOCA   0Dh  ADCTRIG13 - EPWM2, ADCSOCB   0Eh  ADCTRIG14 - EPWM3, ADCSOCA   0Fh  ADCTRIG15 - EPWM3, ADCSOCB   .... EPWM4 to EPWM27 40h ADCTRIG64 - EPWM28, ADCSOCA  41h ADCTRIG65 - EPWM28, ADCSOCB  42h ADCTRIG66 - EPWM29, ADCSOCA  43h ADCTRIG67 - EPWM29, ADCSOCB  44h ADCTRIG68 - EPWM30, ADCSOCA  45h ADCTRIG69 - EPWM30, ADCSOCB  46h ADCTRIG70 - EPWM31, ADCSOCA  47h ADCTRIG71 - EPWM31, ADCSOCB  48h ADCTRIG72 - ECAP0, TRIGOUT  .... ECAP1 to ECAP8  51h ADCTRIG81 - ECAP9, TRIGOUT  52h ADCTRIG82 - ECAP10, TRIGOUT  ....  57h ADCTRIG87 - ECAP15, TRIGOUT 58h ADCTRIG88  - RTI4 Timer  59h ADCTRIG89  - RTI5 Timer   5Ah  ADCTRIG90  - RTI6 Timer   5Bh  ADCTRIG91  - RTI7 Timer  ....    7Fh  ADCTRIG127 - REP2TRIG - these are not external trigger signals on the ADC IP port. We need to configure them for internal selection of repeater triggers.  " range="26:20" rwaccess="R/W"/>
	<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC7 Channel Select. Selects the channel to be converted when SOC7 is received by the ADC. Single-ended Signaling Mode [SIGNALMODE = 0]:  00h ADCIN0  01h ADCIN1  02h ADCIN2  03h ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31 Differential Signaling Mode [SIGNALMODE = 1]:  00h ADCIN0 [non-inverting] and ADCIN1 [inverting]  01h ADCIN0 [non-inverting] and ADCIN1 [inverting]  02h ADCIN2 [non-inverting] and ADCIN3 [inverting]  03h ADCIN2 [non-inverting] and ADCIN3 [inverting]  04h ADCIN4 [non-inverting] and ADCIN5 [inverting]  05h ADCIN4 [non-inverting] and ADCIN5 [inverting]   ...   0Eh  ADCIN26 [non-inverting] and ADCIN27 [inverting]   0Fh  ADCIN26 [non-inverting] and ADCIN27 [inverting]  10h ADCIN28 [non-inverting] and ADCIN29 [inverting]  11h ADCIN28 [non-inverting] and ADCIN29 [inverting]   1Eh  ADCIN30 [non-inverting] and ADCIN31 [inverting]   1Fh  ADCIN30 [non-inverting] and ADCIN31 [inverting]" range="19:15" rwaccess="R/W"/>
	<bitfield id="RESOLUTION" width="3" begin="14" end="12" resetval="0x0" description="Placeholder for per-SOC resolution" range="14:12" rwaccess="R"/>
	<bitfield id="SIGNALMODE" width="2" begin="11" end="10" resetval="0x0" description="Placeholder for per-SOC signal mode" range="11:10" rwaccess="R"/>
	<bitfield id="ACQPS" width="9" begin="8" end="0" resetval="0x0" description="SOC7 Acquisition Prescale. Controls the sample and hold window for this SOC.     000h Reserved  001h Reserved  002h Sample window is 3 system clock cycles wide  003h Sample window is 4 system clock cycles wide   ...   1FFh Sample window is 512 system clock cycles wide The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation.  The configured acquisition time must also be at least 3 SYSCLK cycles long. The device datasheet will also specify a minimum sample and hold window duration." range="8:0" rwaccess="R/W"/>
	</register><register id="ADC_R_CFG_ADCSOC8CTL" acronym="ADC_R_CFG_ADCSOC8CTL" offset="64" width="32" description="ADC SOC8 Control Register.">
		<bitfield id="EXTCHSEL" width="4" begin="31" end="28" resetval="0x0" description="SOC8 External Channel Mux Select. Selects the external mux combination to output  when SOC8 is received by the ADC.  Some or all of the ADCEXTMUX lines can be enabled via the device GPIO mux to control an external analog mux.    0h ADCEXTMUX[3:0] =0000 1h ADCEXTMUX[3:0] =0001 2h ADCEXTMUX[3:0] =0010 3h ADCEXTMUX[3:0] =0011 4h ADCEXTMUX[3:0] =0100 5h ADCEXTMUX[3:0] =0101 6h ADCEXTMUX[3:0] =0110 7h ADCEXTMUX[3:0] =0111 8h ADCEXTMUX[3:0] =1000 9h ADCEXTMUX[3:0] =1001  Ah  ADCEXTMUX[3:0] =1010  Bh  ADCEXTMUX[3:0] =1011  Ch  ADCEXTMUX[3:0] =1100  Dh  ADCEXTMUX[3:0] =1101  Eh  ADCEXTMUX[3:0] =1110  Fh  ADCEXTMUX[3:0] = 1111" range="31:28" rwaccess="R/W"/>
	<bitfield id="TRIGSEL" width="7" begin="26" end="20" resetval="0x0" description="SOC8 Trigger Source Select. Along with the SOC8 field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC8 flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it. Note: SOCFRC1 register can always be used to software trigger SOCs in addition to any hardware trigger configuration.  00h ADCTRIG0 - Software only  01h ADCTRIG1 - RTI0 Timer 02h ADCTRIG2 - RTI1 Timer  03h ADCTRIG3 - RTI2 Timer 04h ADCTRIG4 - RTI3 Timer 05h ADCTRIG5 - InputXBAR.Out[5] 06h ADCTRIG6 - spare  07h ADCTRIG7 - spare  08h ADCTRIG8 - EPWM0, ADCSOCA  09h ADCTRIG9 - EPWM0, ADCSOCB   0Ah  ADCTRIG10 - EPWM1, ADCSOCA   0Bh  ADCTRIG11 - EPWM1, ADCSOCB   0Ch  ADCTRIG12 - EPWM2, ADCSOCA   0Dh  ADCTRIG13 - EPWM2, ADCSOCB   0Eh  ADCTRIG14 - EPWM3, ADCSOCA   0Fh  ADCTRIG15 - EPWM3, ADCSOCB   .... EPWM4 to EPWM27 40h ADCTRIG64 - EPWM28, ADCSOCA  41h ADCTRIG65 - EPWM28, ADCSOCB  42h ADCTRIG66 - EPWM29, ADCSOCA  43h ADCTRIG67 - EPWM29, ADCSOCB  44h ADCTRIG68 - EPWM30, ADCSOCA  45h ADCTRIG69 - EPWM30, ADCSOCB  46h ADCTRIG70 - EPWM31, ADCSOCA  47h ADCTRIG71 - EPWM31, ADCSOCB  48h ADCTRIG72 - ECAP0, TRIGOUT  .... ECAP1 to ECAP8  51h ADCTRIG81 - ECAP9, TRIGOUT  52h ADCTRIG82 - ECAP10, TRIGOUT  ....  57h ADCTRIG87 - ECAP15, TRIGOUT 58h ADCTRIG88  - RTI4 Timer  59h ADCTRIG89  - RTI5 Timer   5Ah  ADCTRIG90  - RTI6 Timer   5Bh  ADCTRIG91  - RTI7 Timer  ....    7Fh  ADCTRIG127 - REP2TRIG - these are not external trigger signals on the ADC IP port. We need to configure them for internal selection of repeater triggers.  " range="26:20" rwaccess="R/W"/>
	<bitfield id="CHSEL" width="5" begin="19" end="15" resetval="0x0" description="SOC8 Channel Select. Selects the channel to be converted when SOC8 is received by the ADC. Single-ended Signaling Mode [SIGNALMODE = 0]:  00h ADCIN0  01h ADCIN1  02h ADCIN2  03h ADCIN3   ...   1Dh  ADCIN29   1Eh  ADCIN30   1Fh  ADCIN31 Differential Signaling Mode [SIGNALMODE = 1]:  00h ADCIN0 [non-inverting] and ADCIN1 [inverting]  01h ADCIN0 [non-inverting] and ADCIN1 [inverting]  02h ADCIN2 [non-inverting] and ADCIN3 [inverting]  03h ADCIN2 [non-inverting] and ADCIN3 [inverting]  04h ADCIN4 [non-inverting] and ADCIN5 [inverting]  05h ADCIN4 [non-inverting] and ADCIN5 [inverting]   ...   0Eh  ADCIN26 [non-inverting] and ADCIN27 [inverting]   0Fh  ADCIN26 [non-inverting] and ADCIN27 [inverting]  10h ADCIN28 [non-inverting] and ADCIN29 [inverting]  11h ADCIN28 [non-inverting] and ADCIN29 [inverting]   1Eh  ADCIN30 [non-inverting] and ADCIN31 [inverting]   1Fh  ADCIN30 [non-inverting] and ADCIN31 [inverting]" range="19:15" rwaccess="R/W"/>
	<bitfield id="RESOLUTION" width="3" begin="14" end="12" resetval="0x0" description="Placeholder for per-SOC resolution" range="14:12" rwaccess="R"/>
