ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/ADC_R_ADC_R_CFG_502C5000h.xml
	<bitfield id="PSUM" width="24" begin="23" end="0" resetval="0x0" description="Post Processing Block 3 Oversampling Partial Sum.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB3RESULT the result is subsequently accumulated into this register.   This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB3 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available.  This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC.  In the case of multiple PPBs associated with the same SOC, the lowest numbered PPB's result will be availble 2 SYSCLK cycle after the associated ADCRESULT and subsequent results [in order from lowest numbered PPB to highest] will each become available every 2-3 SYSCLK cycles [refer to the TRM for detailed timing information]. " range="23:0" rwaccess="R"/>
	</register><register id="ADC_R_CFG_ADCPPB3PMAX" acronym="ADC_R_CFG_ADCPPB3PMAX" offset="440" width="32" description="ADC PPB3 Partial Max Register.">
		<bitfield id="SIGN" width="15" begin="31" end="17" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16." range="31:17" rwaccess="R"/>
	<bitfield id="PMAX" width="17" begin="16" end="0" resetval="0x0" description="Post Processing Block 3 Oversampling Partial Max.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB3RESULT the result replaces this register if it is larger.   This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB3 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB3RESULT timing information]. " range="16:0" rwaccess="R"/>
	</register><register id="ADC_R_CFG_ADCPPB3PMAXI" acronym="ADC_R_CFG_ADCPPB3PMAXI" offset="444" width="16" description="ADC PPB3 Partial Max Index Register.">
		<bitfield id="PMAXI" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 3 Oversampling Partial Index of Max.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB3RESULT if the result replaces PMAX this register is loaded with the current value of PCOUNT.  This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB3 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB3RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_R_CFG_ADCPPB3PMIN" acronym="ADC_R_CFG_ADCPPB3PMIN" offset="448" width="32" description="ADC PPB3 Partial MIN Register.">
		<bitfield id="SIGN" width="15" begin="31" end="17" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16." range="31:17" rwaccess="R"/>
	<bitfield id="PMIN" width="17" begin="16" end="0" resetval="0x0" description="Post Processing Block 3 Oversampling Partial Min.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB3RESULT the result replaces this register if it is smaller.   This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB3 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB3RESULT timing information]. " range="16:0" rwaccess="R"/>
	</register><register id="ADC_R_CFG_ADCPPB3PMINI" acronym="ADC_R_CFG_ADCPPB3PMINI" offset="452" width="16" description="ADC PPB3 Partial Min Index Register.">
		<bitfield id="PMINI" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 3 Oversampling Partial Index of Min.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB3RESULT if the result replaces PMIN this register is loaded with the current value of PCOUNT.  This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB3 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB3RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_R_CFG_ADCPPB3TRIPLO2" acronym="ADC_R_CFG_ADCPPB3TRIPLO2" offset="456" width="32" description="ADC PPB3 Extended Trip Low Register.">
		<bitfield id="LIMITLO" width="24" begin="23" end="0" resetval="0x0" description="ADC Post Processing Block 3 Trip High Low Limit. This value sets the digital comparator trip low limit if ADCPPB3TRIPLO.LIMITLO2EN = 1.  When comparing to an ADCPPBxRESULT register, the upper bits will be ignored: - TRIPLO2[23:17] will be ignored in 16 bit mode - TRIPLO2[23:13] will be ignored in 12 bit mode" range="23:0" rwaccess="R/W"/>
	</register><register id="ADC_R_CFG_ADCPPB4LIMIT" acronym="ADC_R_CFG_ADCPPB4LIMIT" offset="476" width="16" description="ADC PPB4Conversion Count Limit Register.">
		<bitfield id="LIMIT" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 4 Oversampling Limit.  Defines the number of conversions to accumulate before PSUM is automatically loaded into SUM.   To prevent PSUM from overflowing, do not write a value larger than 128 when the ADC is operating in 16-bit mode.  " range="9:0" rwaccess="R/W"/>
	</register><register id="ADC_R_CFG_ADCPPBP4PCOUNT" acronym="ADC_R_CFG_ADCPPBP4PCOUNT" offset="480" width="16" description="ADC PPB4 Partial Conversion Count Register.">
		<bitfield id="PCOUNT" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 4 Oversampling Partial Count.  Each time a new result propagates through the PPB signal chain and accumulates into ADCPPB4PSUM this register is incremented by 1.   This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB4 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB4RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_R_CFG_ADCPPB4CONFIG2" acronym="ADC_R_CFG_ADCPPB4CONFIG2" offset="484" width="16" description="ADC PPB4 Sum Shift Register.">
		<bitfield id="COMPSEL" width="2" begin="15" end="14" resetval="0x0" description="Post Processing Block 4 Compare Source Select.  This field determines whether ADCPPB4RESULT, ADCPPB4PSUM, or ADCPPB4SUM is used for the zero-crossing detect logic and threshold compare. 00 = ADCPPB4RESULT is used for compare logic 01 = ADCPPB4PSUM is used for compare logic 10 = ADCPPB4SUM is used for compare logic 11 = Reserved Note: when ADCPPB4PSUM is selected as the compare source and when a LIMIT match occurs [ADCPPB4LIMIT equals ADCPPB4COUNT] the ADCPPB4PSUM register will be cleared and the final sum will be loaded into ADCPPB4SUM.  For this sample, the final sum, ADCPPB4SUM will be used for the compariosn instead of ADCPPB4PSUM. " range="15:14" rwaccess="R/W"/>
	<bitfield id="OSINTSEL" width="1" begin="12" end="12" resetval="0x0" description="Post Processing Block 4 Interrupt Source Select.  OSINT4 can be used to trigger an ADC interrupt [ADCINT1 through ADCINT4] via selection in the ADCINT1N2 or ADCINT3N4.  This selection determines if a sync. event can trigger OSINT4 in addition to a PCOUNT = LIMIT event.        0 = OSINT4 will be generated from PCOUNT = LIMIT only 1 = OSTIN4 will be generated form PCOUNT = LIMIT or a sync. event.   Note: If a SYNC event would cause an OSINT one cycle after OSINT would have been cause by PCOUNT = LIMIT match, then the second OSINT is ignored. " range="12" rwaccess="R/W"/>
	<bitfield id="SWSYNC" width="1" begin="11" end="11" resetval="0x0" description="PPB 4 software force sync.  On a sync. event, all partial registers transfer to the final registers and are then reset.  Note: In the case where the software force occurs at the same time that a new sample is added to the PSUM and the PSUM is being used for a high or low limit compare, then the comparison will not occur.   " range="11" rwaccess="R/W1TS"/>
	<bitfield id="SYNCINSEL" width="6" begin="9" end="4" resetval="0x0" description="PPB 4 sync. input select.  On a sync. event, all partial registers transfer to the final registers and are then reset.   Refer to SOC spec for details" range="9:4" rwaccess="R/W"/>
	<bitfield id="SHIFT" width="4" begin="3" end="0" resetval="0x0" description="Post Processing Block 4 right shift.  Defines the number of bits to right shift PSUM before loading into the final SUM.   0 : no right shift 1 : SUM = PSUM '' 1 2 : SUM = PSUM '' 2 ... 10 : SUM = PSUM '' 10 11 -15 : Reserved" range="3:0" rwaccess="R/W"/>
	</register><register id="ADC_R_CFG_ADCPPB4PSUM" acronym="ADC_R_CFG_ADCPPB4PSUM" offset="488" width="32" description="ADC PPB4 Partial Sum Register.">
		<bitfield id="SIGN" width="8" begin="31" end="24" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 23." range="31:24" rwaccess="R"/>
	<bitfield id="PSUM" width="24" begin="23" end="0" resetval="0x0" description="Post Processing Block 4 Oversampling Partial Sum.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB4RESULT the result is subsequently accumulated into this register.   This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB4 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available.  This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC.  In the case of multiple PPBs associated with the same SOC, the lowest numbered PPB's result will be availble 2 SYSCLK cycle after the associated ADCRESULT and subsequent results [in order from lowest numbered PPB to highest] will each become available every 2-3 SYSCLK cycles [refer to the TRM for detailed timing information]. " range="23:0" rwaccess="R"/>
	</register><register id="ADC_R_CFG_ADCPPB4PMAX" acronym="ADC_R_CFG_ADCPPB4PMAX" offset="492" width="32" description="ADC PPB4 Partial Max Register.">
		<bitfield id="SIGN" width="15" begin="31" end="17" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16." range="31:17" rwaccess="R"/>
	<bitfield id="PMAX" width="17" begin="16" end="0" resetval="0x0" description="Post Processing Block 4 Oversampling Partial Max.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB4RESULT the result replaces this register if it is larger.   This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB4 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB4RESULT timing information]. " range="16:0" rwaccess="R"/>
	</register><register id="ADC_R_CFG_ADCPPB4PMAXI" acronym="ADC_R_CFG_ADCPPB4PMAXI" offset="496" width="16" description="ADC PPB4 Partial Max Index Register.">
		<bitfield id="PMAXI" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 4 Oversampling Partial Index of Max.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB4RESULT if the result replaces PMAX this register is loaded with the current value of PCOUNT.  This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB4 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB4RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_R_CFG_ADCPPB4PMIN" acronym="ADC_R_CFG_ADCPPB4PMIN" offset="500" width="32" description="ADC PPB4 Partial MIN Register.">
		<bitfield id="SIGN" width="15" begin="31" end="17" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16." range="31:17" rwaccess="R"/>
	<bitfield id="PMIN" width="17" begin="16" end="0" resetval="0x0" description="Post Processing Block 4 Oversampling Partial Min.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB4RESULT the result replaces this register if it is smaller.   This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB4 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB4RESULT timing information]. " range="16:0" rwaccess="R"/>
	</register><register id="ADC_R_CFG_ADCPPB4PMINI" acronym="ADC_R_CFG_ADCPPB4PMINI" offset="504" width="16" description="ADC PPB4 Partial Min Index Register.">
		<bitfield id="PMINI" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 4 Oversampling Partial Index of Min.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB4RESULT if the result replaces PMIN this register is loaded with the current value of PCOUNT.  This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB4 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB4RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_R_CFG_ADCPPB4TRIPLO2" acronym="ADC_R_CFG_ADCPPB4TRIPLO2" offset="508" width="32" description="ADC PPB4 Extended Trip Low Register.">
		<bitfield id="LIMITLO" width="24" begin="23" end="0" resetval="0x0" description="ADC Post Processing Block 4 Trip High Low Limit. This value sets the digital comparator trip low limit if ADCPPB4TRIPLO.LIMITLO2EN = 1.  When comparing to an ADCPPBxRESULT register, the upper bits will be ignored: - TRIPLO2[23:17] will be ignored in 16 bit mode - TRIPLO2[23:13] will be ignored in 12 bit mode" range="23:0" rwaccess="R/W"/>
	</register>
</module>